---
kind: type
id: T:Autodesk.Revit.DB.PointClouds.PointCollection
source: html/3eaab06f-0da5-dd0a-6063-b3907f6de7a8.htm
---
# Autodesk.Revit.DB.PointClouds.PointCollection

A class that represents a set of points created and returned by Revit in response to a query.

## Syntax (C#)
```csharp
public class PointCollection : IEnumerable<CloudPoint>,
	IDisposable
```